New folder (2)/RES.txt

<?xml version='1.0' encoding='UTF-8'?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
	<S:Header>
		<work:WorkContext xmlns:work="http://oracle.com/weblogic/soap/workarea/">rO0ABXemAB53ZWJsb2dpYy5hcHAuRkNVQlNFeHRQQ1NlcnZpY2UAAADWAAAAI3dlYmxvZ2ljLndvcmthcmVhLlN0cmluZ1dvcmtDb250ZXh0AAsxMi4wLjMuMjIuMAASd2VibG9naWMuYXBwLkdXRUpCAAAA1gAAACN3ZWJsb2dpYy53b3JrYXJlYS5TdHJpbmdXb3JrQ29udGV4dAALMTIuMC4zLjIyLjAAAA==</work:WorkContext>
	</S:Header>
	<S:Body>
		<CREATEPCCONTRACT_FSFS_RES xmlns="http://fcubs.ofss.com/service/FCUBSExtPCService">
			<FCUBS_HEADER>
				<SOURCE>FLEXCUBE</SOURCE>
				<UBSCOMP>FCUBS</UBSCOMP>
				<MSGID>66c7e8000762810</MSGID>
				<CORRELID>66c7e8000762810</CORRELID>
				<USERID>FCATOP</USERID>
				<BRANCH>005</BRANCH>
				<SERVICE>FCUBSExtPCService</SERVICE>
				<OPERATION>CreatePCContract</OPERATION>
				<SOURCE_OPERATION/>
				<DESTINATION>FCAT</DESTINATION>
				<FUNCTIONID>PCDTRONL</FUNCTIONID>
				<ACTION>NEW</ACTION>
				<MSGSTAT>SUCCESS</MSGSTAT>
				<ADDL/>
			</FCUBS_HEADER>
			<FCUBS_BODY>
				<Pctb-Contract-Master-Full>
					<RESADVREQ>N</RESADVREQ>
					<TXNCCY>MMK</TXNCCY>
					<CUSACCCY>MMK</CUSACCCY>
					<REMRK>Bill Payment request from OBDX</REMRK>
					<CUSADD1>ADDRESS_1_001001754</CUSADD1>
					<CUSADD2>ADDRESS_2_001001754</CUSADD2>
					<CUSADD3>ADDRESS_3_001001754</CUSADD3>
					<CUSADD4>ADDRESS_4_001001754</CUSADD4>
					<CUSTNAM>FULL_NAME_001001754</CUSTNAM>
					<CUSAVLBAL>40000</CUSAVLBAL>
					<CLGBRN>005</CLGBRN>
					<CONTRACT_REFERENCE_NUMBER>005BTPT213440001</CONTRACT_REFERENCE_NUMBER>
					<SRCCOD>FCAT</SRCCOD>
					<SRCREF>66c7e8000762810</SRCREF>
					<CUSTOMREF>005BTPT213440001</CUSTOMREF>
					<PRDCAT>BTPT</PRDCAT>
					<PRDCOD>BTRF</PRDCOD>
					<PRDTYP>O</PRDTYP>
					<CUSTNO>001001754</CUSTNO>
					<CUSBNKCOD>91929192005</CUSBNKCOD>
					<CUSACLCF>00501401001001754001</CUSACLCF>
					<ACBRN1>005</ACBRN1>
					<CUSACNO>00501401001001754001</CUSACNO>
					<TXNAMT>9800</TXNAMT>
					<EXRAT>1</EXRAT>
					<CPBNKCOD>91929192005</CPBNKCOD>
					<CPACNO>228101029</CPACNO>
					<CUTOFSTAT>R</CUTOFSTAT>
					<ACTDT>2021-12-09</ACTDT>
					<DISDT>2021-12-09</DISDT>
					<DISDT>2021-12-09</DISDT>
					<GENADV>Y</GENADV>
					<DISPCH>Y</DISPCH>
					<AMFLAG>M</AMFLAG>
					<ACTAMT>10000</ACTAMT>
					<CRGMOD>D</CRGMOD>
					<CVRREQ>N</CVRREQ>
					<LCYEQAMT>9800</LCYEQAMT>
					<COLLSTAT>N</COLLSTAT>
					<MSGSTAT>NA</MSGSTAT>
					<EXQUEUE>##</EXQUEUE>
					<TXNSTAT>A</TXNSTAT>
					<BRNOFINP>005</BRNOFINP>
					<BRNCOD>005</BRNCOD>
					<BOOKDT>2021-12-10</BOOKDT>
					<REDISREQ>N</REDISREQ>
					<DCLG_PROCESSED>Y</DCLG_PROCESSED>
					<REDISPATCHED>N</REDISPATCHED>
					<CHARGE_WAIVER>N</CHARGE_WAIVER>
					<CHARGE_AC_STATISTICS>N</CHARGE_AC_STATISTICS>
					<CHARGE_CUST_STATISTICS>N</CHARGE_CUST_STATISTICS>
					<ASCII_HANDOFF_REQD>N</ASCII_HANDOFF_REQD>
					<XREF_PROCESSED>N</XREF_PROCESSED>
					<MISC_PROCESSED>Y</MISC_PROCESSED>
					<AUTO_DISPATCH>Y</AUTO_DISPATCH>
					<DISP_FILE_NAME>BOOK_DISPATCH</DISP_FILE_NAME>
					<OLD_ACTIVATION_DT>2021-12-09</OLD_ACTIVATION_DT>
					<WIP>N</WIP>
					<DEFERRED_EVENTS>$$</DEFERRED_EVENTS>
					<ADV_PROCESSED>Y</ADV_PROCESSED>
					<DISPATCH_MEDIA>F</DISPATCH_MEDIA>
					<BNKCITY>YANGON</BNKCITY>
					<CUS_BNKCITY>YANGON</CUS_BNKCITY>
					<ACDESC>CUSTOMER_001001754</ACDESC>
					<INPUTDT>2021-12-10 15:22:34</INPUTDT>
					<AUTHORIZATION_STATUS>A</AUTHORIZATION_STATUS>
					<INPUTBY>FCATOP</INPUTBY>
					<AUTHBY>FCATOP</AUTHBY>
					<INPUTDTST>2021-12-10 15:22:34</INPUTDTST>
					<AUTRES>N</AUTRES>
					<AUTO_REDISPATCH>N</AUTO_REDISPATCH>
					<REDISPATCH_INDICATOR>N</REDISPATCH_INDICATOR>
					<REDISNO>0</REDISNO>
					<INITIATION_DT>2021-12-10</INITIATION_DT>
					<CUST_ENTRY_DT>2021-12-09</CUST_ENTRY_DT>
					<CUST_ENTRY_VAL_DT>2021-12-09</CUST_ENTRY_VAL_DT>
					<CPTY_ENTRY_DT>2021-12-09</CPTY_ENTRY_DT>
					<CPTY_ENTRY_VAL_DT>2021-12-09</CPTY_ENTRY_VAL_DT>
					<CUST_CONS_PROD>N</CUST_CONS_PROD>
					<RELATED_TXN>005BTIC213440001</RELATED_TXN>
					<AC_REDIRECT>N</AC_REDIRECT>
					<BANK_REDIRECT>N</BANK_REDIRECT>
					<LAST_EVENT_CODE>DCLG</LAST_EVENT_CODE>
					<NLS_AC_ENTRY_REF_NO>005BTRF213440001</NLS_AC_ENTRY_REF_NO>
					<LOCAL_CCY>MMK</LOCAL_CCY>
					<REMITTEFD_AMOUNT_CURRENCY>MMK</REMITTEFD_AMOUNT_CURRENCY>
					<BRNNAME>005-BAYINTNAUNG BRANCH</BRNNAME>
					<CHGAMT>200</CHGAMT>
					<INVOICE_SPLIT_REQD>N</INVOICE_SPLIT_REQD>
					<SPLIT_INDICATOR>N</SPLIT_INDICATOR>
					<SPLTNO>0</SPLTNO>
					<CUST_BANKNAME>Myanma Tourism Bank Ltd.</CUST_BANKNAME>
					<BANK_NAME>Myanma Tourism Bank Ltd.</BANK_NAME>
					<CATGPURPTYP>C</CATGPURPTYP>
					<RATE_CODE>B</RATE_CODE>
					<Pctbs-Udf-Details>
						<FLDNAME>PRIORITY</FLDNAME>
						<FLDVAL>NORMAL</FLDVAL>
						<FLDNO>1</FLDNO>
					</Pctbs-Udf-Details>
					<Pctbs-Udf-Details>
						<FLDNAME>BILLER_NUMBER</FLDNAME>
						<FLDVAL>MPTELOAD</FLDVAL>
						<FLDNO>2</FLDNO>
					</Pctbs-Udf-Details>
					<Pctbs-Contract-Charge>
						<FCCREF>005BTPT213440001</FCCREF>
						<CHG1CCY>MMK</CHG1CCY>
						<CHG1ACCCY>MMK</CHG1ACCCY>
						<CHG1AMT>200</CHG1AMT>
						<CHG1ACBRN>005</CHG1ACBRN>
						<CHG1ACNO>00501401001001754001</CHG1ACNO>
					</Pctbs-Contract-Charge>
					<Wrkflow>
						<CURRSTAT>CD</CURRSTAT>
						<NXT_STAT>RV</NXT_STAT>
					</Wrkflow>
					<Misdetails>
						<CONREFNO>005BTPT213440001</CONREFNO>
						<RATEFLG>P</RATEFLG>
						<TRANMIS1>COS_CENTR</TRANMIS1>
						<TRANMIS2>LOAN_TYPE</TRANMIS2>
						<TRANMIS3>LOAN_TERM</TRANMIS3>
						<TRANMIS5>MIS_UDF</TRANMIS5>
						<TRANMIS6>TEST_MIS</TRANMIS6>
						<TRANMIS7>TEST</TRANMIS7>
						<TRANMIS8>MIS1</TRANMIS8>
						<TRANMIS9>MIS2</TRANMIS9>
						<TRANMIS10>MIS_CBR</TRANMIS10>
						<COMMIS1>ACC_OFFCR</COMMIS1>
						<COMMIS2>AD1</COMMIS2>
						<COMMIS3>RT_TEST1</COMMIS3>
						<FUNMIS1>FUNDID</FUNMIS1>
						<FUNMIS2>NEW</FUNMIS2>
					</Misdetails>
					<Pctbs-Contract-Master>
						<FCCREF>005BTPT213440001</FCCREF>
						<Pcvws-Dup-Contract-Details>
							<FCCREF>005BTPT213440001</FCCREF>
							<CUSTOMREF>005BTPT213440001</CUSTOMREF>
							<PRDCAT>BTPT</PRDCAT>
							<CUSTNO>001001754</CUSTNO>
							<ACTIVATION_DT>2021-12-09</ACTIVATION_DT>
							<CPBNKCOD>91929192005</CPBNKCOD>
							<TXNAMT>9800</TXNAMT>
						</Pcvws-Dup-Contract-Details>
					</Pctbs-Contract-Master>
					<Rever>
						<FCCREF>005BTPT213440001</FCCREF>
					</Rever>
					<Rjrcl>
						<FCCREF>005BTPT213440001</FCCREF>
					</Rjrcl>
					<Taxes/>
				</Pctb-Contract-Master-Full>
				<FCUBS_WARNING_RESP>
					<WARNING>
						<WCODE>PC-SVV-057</WCODE>
						<WDESC>Activation date 09-DEC-21 is back dated</WDESC>
					</WARNING>
					<WARNING>
						<WCODE>PC-RK003</WCODE>
						<WDESC>Counterparty Account entered is Not Valid. Could not Continue.</WDESC>
					</WARNING>
					<WARNING>
						<WCODE>PC-ONL0002</WCODE>
						<WDESC>Bank Name is Myanma Tourism Bank Ltd.</WDESC>
					</WARNING>
					<WARNING>
						<WCODE>PC-ONL0001</WCODE>
						<WDESC>Customer Name is CUSTOMER_001001754</WDESC>
					</WARNING>
					<WARNING>
						<WCODE>PC-SVV-057</WCODE>
						<WDESC>Activation date 09-DEC-21 is back dated</WDESC>
					</WARNING>
					<WARNING>
						<WCODE>PC-SAV-02L</WCODE>
						<WDESC>Activation date 09-DEC-21 is before receive date 10-DEC-21</WDESC>
					</WARNING>
					<WARNING>
						<WCODE>PC-SVV-057</WCODE>
						<WDESC>Activation date 228101029 is back dated</WDESC>
					</WARNING>
					<WARNING>
						<WCODE>PC-ONL0001</WCODE>
						<WDESC>Customer Name is Myanma Tourism Bank Ltd.</WDESC>
					</WARNING>
					<WARNING>
						<WCODE>ST-SAVE-052</WCODE>
						<WDESC>Successfully Saved and Authorized</WDESC>
					</WARNING>
				</FCUBS_WARNING_RESP>
			</FCUBS_BODY>
		</CREATEPCCONTRACT_FSFS_RES>
	</S:Body>
</S:Envelope>--------------------
